[
  {
    "id": 1,
    "image": "https://i.ibb.co.com/848B40gs/Screenshot-2025-09-12-201408.png",
    "title": "Smart Fitness Tracker",
    "description": "Stay ahead in your fitness journey with the Smart Fitness Tracker, built for those who value precision and style. It monitors your steps, sleep patterns, heart rate, and oxygen levels with impressive accuracy. The lightweight design and long-lasting battery make it perfect for everyday wear. You can sync your data instantly through Bluetooth, receive notifications, and even track workouts in real time, ensuring you stay consistent with your health and wellness goals effortlessly."
  },
  {
    "id": 2,
    "image": "https://i.ibb.co.com/x8S5xZz1/Whats-App-Image-2025-10-07-at-19-45-12-0030e17e.jpg",
    "title": "Wireless Earbuds",
    "description": "Experience pure sound freedom with Wireless Earbuds designed for comfort and quality. Equipped with noise isolation and high-definition audio, they deliver clear tones and deep bass for an immersive experience. The ergonomic design ensures a perfect fit, while the compact charging case provides up to 24 hours of playback. With a reliable Bluetooth 5.3 connection and touch-sensitive controls, you can manage calls, music, and voice assistants seamlessly wherever your day takes you."
  },
  {
    "id": 3,
    "image": "https://i.ibb.co.com/848B40gs/Screenshot-2025-09-12-201408.png",
    "title": "4K Action Camera",
    "description": "Capture your adventures in stunning detail with the 4K Action Camera. Featuring ultra-high-definition video recording, image stabilization, and a waterproof casing, this camera is perfect for outdoor enthusiasts and travelers. Its wide-angle lens ensures breathtaking panoramic shots, while the intuitive touchscreen makes navigation easy. With built-in Wi-Fi, you can instantly share your moments or transfer footage. Durable, compact, and powerful, it’s the ideal companion for documenting every thrilling experience in vibrant clarity."
  },
  {
    "id": 4,
    "image": "https://i.ibb.co.com/848B40gs/Screenshot-2025-09-12-201408.png",
    "title": "Ergonomic Office Chair",
    "description": "Engineered for maximum comfort, the Ergonomic Office Chair provides excellent lumbar support for long working hours. The breathable mesh back keeps you cool, while the adjustable armrests and reclining function allow complete customization. Its sturdy frame and smooth wheels offer effortless mobility and long-term durability. Whether at home or in the office, this chair ensures proper posture, reduces back strain, and creates a productive, comfortable workspace tailored to your daily routine."
  },
  {
    "id": 5,
    "image": "https://i.ibb.co.com/848B40gs/Screenshot-2025-09-12-201408.png",
    "title": "Bluetooth Speaker",
    "description": "Bring your music to life anywhere with the Portable Bluetooth Speaker. It delivers rich, room-filling sound with deep bass and crisp highs. The compact and water-resistant design makes it perfect for indoor and outdoor use. With up to 12 hours of playtime, it’s built for long listening sessions. The integrated microphone allows hands-free calls, while Bluetooth 5.0 ensures fast, stable connectivity across all devices for an uninterrupted listening experience."
  },
  {
    "id": 6,
    "image": "https://i.ibb.co.com/848B40gs/Screenshot-2025-09-12-201408.png",
    "title": "Smart LED Desk Lamp",
    "description": "Illuminate your workspace intelligently with the Smart LED Desk Lamp. It features adjustable brightness and color temperatures to suit every mood, from focus mode to relaxation. The energy-efficient LEDs reduce eye strain and save power. You can control it via touch or voice commands when paired with smart home assistants. With its minimalistic design and flexible arm, it enhances your productivity while adding a modern touch to any study or office desk."
  },
  {
    "id": 7,
    "image": "https://i.ibb.co.com/4gKfXNmC/image.png",
    "title": "Mechanical Keyboard",
    "description": "Enhance your typing experience with the premium Mechanical Keyboard designed for gamers and professionals. It features tactile keys with RGB backlighting and anti-ghosting technology for responsive performance. The durable metal frame ensures long-lasting stability, while customizable macros allow seamless control. Compatible with multiple operating systems, this keyboard provides both comfort and precision. Whether for gaming marathons or coding sessions, it delivers accuracy, style, and endurance with every keystroke."
  },
  {
    "id": 8,
    "image": "https://i.ibb.co.com/x8S5xZz1/Whats-App-Image-2025-10-07-at-19-45-12-0030e17e.jpg",
    "title": "Headphones",
    "description": "Immerse yourself in silence and sound with Noise Cancelling Headphones that block unwanted distractions. Featuring superior sound drivers and adaptive noise control, they deliver a studio-quality experience. The soft memory foam cushions provide comfort during long sessions, while the foldable design makes storage easy. Enjoy 35 hours of playback on one charge and fast charging for extra convenience. Perfect for travel, work, or relaxation, these headphones redefine your listening experience."
  },
  {
    "id": 9,
    "image": "https://i.ibb.co.com/848B40gs/Screenshot-2025-09-12-201408.png",
    "title": "Portable Power Bank",
    "description": "Never run out of battery again with the ultra-compact Portable Power Bank. Equipped with dual USB outputs and fast-charging support, it can charge two devices simultaneously. The high-capacity lithium battery ensures multiple full charges for smartphones and tablets. Its sleek aluminum casing provides durability and style, while built-in safety features protect against overheating and overcharging. Ideal for travel, commuting, or emergencies, this power bank is your reliable energy companion."
  },
  {
    "id": 10,
    "image": "https://i.ibb.co.com/4gKfXNmC/image.png",
    "title": "Smart Home Plug",
    "description": "Turn any ordinary appliance into a smart device with the Smart Home Plug. Controlled via mobile app or voice commands, it lets you schedule, automate, and monitor energy usage effortlessly. Compatible with Alexa and Google Assistant, it simplifies home automation. The compact design doesn’t block adjacent outlets, and the energy monitoring feature helps save power. It’s perfect for controlling lights, fans, and chargers with just a tap or a voice command."
  },
  {
    "id": 11,
    "image": "https://i.ibb.co.com/848B40gs/Screenshot-2025-09-12-201408.png",
    "title": "Digital Drawing Tablet",
    "description": "Unleash your creativity with the high-resolution Digital Drawing Tablet designed for artists and designers. The responsive pen offers precision and natural pressure sensitivity for lifelike strokes. With customizable shortcut buttons and multi-screen support, it enhances your workflow. Compatible with major software like Photoshop and Illustrator, it’s ideal for professionals and beginners alike. Its lightweight build and wide active area provide comfort and accuracy for every creative project or digital illustration."
  },
  {
    "id": 12,
    "image": "https://i.ibb.co.com/848B40gs/Screenshot-2025-09-12-201408.png",
    "title": "Smart Security Camera",
    "description": "Protect what matters most with the Smart Security Camera featuring full HD video and night vision. It offers motion detection alerts, two-way audio, and cloud storage for safety and convenience. The camera’s compact design allows easy installation indoors or outdoors. With mobile app integration, you can monitor your home or office remotely in real time. Secure, reliable, and easy to use, it ensures peace of mind day and night."
  }
]
