[
  {
    "year": "2025",
    "image": "src/assets/dummy/image1.png",
    "title": "IEEE IAS CMD Chapter Award 2025 - IEEE NSU Industry",
    "winner": "IEEE NSU Industry Application Society Student Branch Chapter",
    "description":
      "We are proud to announce that IEEE North South University Industry Applications Society Student Branch Chapter has been awarded the prestigious IEEE IAS CMD Chapter Award 2025 for Outstanding Chapter Performance. What makes this achievement even more special is that we are the only chapter from Bangladesh to have received this honor twice, and we were the first chapter from Bangladesh to win it as well — both under the Small Chapter category! This award reflects our continued commitment to excellence, innovation, and impactful contributions in industrial applications. We are proud to announce that IEEE North South University Industry Applications Society Student Branch Chapter has been awarded the prestigious IEEE IAS CMD Chapter Award 2025 for Outstanding Chapter Performance. What makes this achievement even more special is that we are the only chapter from Bangladesh to have received this honor twice, and we were the first chapter from Bangladesh to win it as well — both under the Small Chapter category! This award reflects our continued commitment to excellence, innovation, and impactful contributions in industrial applications. We are proud to announce that IEEE North South University Industry Applications Society Student Branch Chapter has been awarded the prestigious IEEE IAS CMD Chapter Award 2025 for Outstanding Chapter Performance. What makes this achievement even more special is that we are the only chapter from Bangladesh to have received this honor twice, and we were the first chapter from Bangladesh to win it as well — both under the Small Chapter category! This award reflects our continued commitment to excellence, innovation, and impactful contributions in industrial applications. We are proud to announce that IEEE North South University Industry Applications Society Student Branch Chapter has been awarded the prestigious IEEE IAS CMD Chapter Award 2025 for Outstanding Chapter Performance. What makes this achievement even more special is that we are the only chapter from Bangladesh to have received this honor twice, and we were the first chapter from Bangladesh to win it as well — both under the Small Chapter category! This award reflects our continued commitment to excellence, innovation, and impactful contributions in industrial applications. We are proud to announce that IEEE North South University Industry Applications Society Student Branch Chapter has been awarded the prestigious IEEE IAS CMD Chapter Award 2025 for Outstanding Chapter Performance. What makes this achievement even more special is that we are the only chapter from Bangladesh to have received this honor twice, and we were the first chapter from Bangladesh to win it as well — both under the Small Chapter category! This award reflects our continued commitment to excellence, innovation, and impactful contributions in industrial applications. We are proud to announce that IEEE North South University Industry Applications Society Student Branch Chapter has been awarded the prestigious IEEE IAS CMD Chapter Award 2025 for Outstanding Chapter Performance. What makes this achievement even more special is that we are the only chapter from Bangladesh to have received this honor twice, and we were the first chapter from Bangladesh to win it as well — both under the Small Chapter category! This award reflects our continued commitment to excellence, innovation, and impactful contributions in industrial applications. We are proud to announce that IEEE North South University Industry Applications Society Student Branch Chapter has been awarded the prestigious IEEE IAS CMD Chapter Award 2025 for Outstanding Chapter Performance. What makes this achievement even more special is that we are the only chapter from Bangladesh to have received this honor twice, and we were the first chapter from Bangladesh to win it as well — both under the Small Chapter category! This award reflects our continued commitment to excellence, innovation, and impactful contributions in industrial applications. We are proud to announce that IEEE North South University Industry Applications Society Student Branch Chapter has been awarded the prestigious IEEE IAS CMD Chapter Award 2025 for Outstanding Chapter Performance. What makes this achievement even more special is that we are the only chapter from Bangladesh to have received this honor twice, and we were the first chapter from Bangladesh to win it as well — both under the Small Chapter category! This award reflects our continued commitment to excellence, innovation, and impactful contributions in industrial applications."
  },
  {
    "year": "2026",
    "image": "src/assets/dummy/image2.png",
    "title": "WIE Outstanding SB AG Award - IEEE NSU Student",
    "winner": "IEEE NSU Industry Application Society Student Branch Chapter",
    "description":
      "We are thrilled to announce that IEEE NSU Student Branch, WIE Affinity Group has been honored with the prestigious WIE Outstanding Student Branch Affinity Group Award in the IEEE Bangladesh Section for 2024! This marks the second consecutive year that IEEE NSU SB WIE AG has achieved such recognition."
  },
  {
    "year": "2024",
    "image": "src/assets/dummy/image3.png",
    "title": "Outstanding Student Volunteer Award - IEEE NSU",
    "winner": "IEEE NSU Industry Application Society Student Branch Chapter",
    "description":
      "Huge Congratulations to Our Chair! We are thrilled to announce that Mohammad Iftekhar Bin Ashraf, Chair of IEEE NSU Student Branch, has received the Outstanding Student Volunteer Award 2024 from IEEE Bangladesh Section! This well-deserved award recognizes his amazing work over the past 1.5 year's as a chair. During this time, he has tirelessly led this student branch and organized a diverse range of events, including technical, non-technical, professional, humanitarian, and administrative activities."
  },
  {
    "year": "2025",
    "image": "src/assets/dummy/image4.png",
    "title": "IEEE IAS CMD Chapter Award 2025 - IEEE NSU Industry",
    "winner": "IEEE NSU Industry Application Society Student Branch Chapter",
    "description":
      "We are proud to announce that IEEE North South University Industry Applications Society Student Branch Chapter has been awarded the prestigious IEEE IAS CMD Chapter Award 2025 for Outstanding Chapter Performance. What makes this achievement even more special is that we are the only chapter from Bangladesh to have received this honor twice, and we were the first chapter from Bangladesh to win it as well — both under the Small Chapter category! This award reflects our continued commitment to excellence, innovation, and impactful contributions in industrial applications."
  },
  {
    "year": "2024",
    "image": "src/assets/dummy/image5.png",
    "title": "WIE Outstanding SB AG Award - IEEE NSU Student",
    "winner": "IEEE NSU Industry Application Society Student Branch Chapter",
    "description":
      "We are thrilled to announce that IEEE NSU Student Branch, WIE Affinity Group has been honored with the prestigious WIE Outstanding Student Branch Affinity Group Award in the IEEE Bangladesh Section for 2024! This marks the second consecutive year that IEEE NSU SB WIE AG has achieved such recognition."
  },
  {
    "year": "2024",
    "image": "src/assets/dummy/image1.png",
    "title": "Outstanding Student Volunteer Award - IEEE NSU",
    "winner": "IEEE NSU Industry Application Society Student Branch Chapter",
    "description":
      "Huge Congratulations to Our Chair! We are thrilled to announce that Mohammad Iftekhar Bin Ashraf, Chair of IEEE NSU Student Branch, has received the Outstanding Student Volunteer Award 2024 from IEEE Bangladesh Section! This well-deserved award recognizes his amazing work over the past 1.5 year's as a chair. During this time, he has tirelessly led this student branch and organized a diverse range of events, including technical, non-technical, professional, humanitarian, and administrative activities."
  }
]