{
  "ag_banner": [
    {
      "id": "ieee-nsu-ras-sbc",
      "title": "About RAS",
      "color": "#602569",
      "description": [
        "The IEEE NSU Robotics and Automation Society Student Chapter, established on January 5th, 2017, is a pivotal technical chapter within the IEEE NSU Student Branch. Focused on research, study, and knowledge exchange in Robotics & Automation, It is the first Robotics and Automation Society Student Chapter in Bangladesh. Since its inception, the IEEE NSU RAS SB Chapter has been actively involved in promoting robotics and automation within the community. Through continuous evolution and member training, the chapter is committed to shaping future leaders in the field. Aligned with IEEE RAS standards, it maintains a steadfast dedication to upholding high academic standards in research and related literary endeavors."
      ],
      "image": "ras.png"
    },
    {
      "id": "ieee-nsu-pes-sbc",
      "title": "About PES",
      "color": "#659941",
      "description": [
        "IEEE NSU PES Student Branch Chapter is a dynamic technical sub-unit of IEEE Societies committed to advancing knowledge and innovation in the field of electric power and energy. Its mission is to provide scientific and engineering information to benefit society and foster the professional development of our members.",
        "IEEE NSU PES SBC is dedicated to conducting cutting-edge research activities and implementing advanced technological ideas to contribute to the field of Power and Energy. In recognition of its efforts, the IEEE NSU PES Student Branch Chapter has achieved notable milestones, including ranking 5th in the Asia Pacific [IEEE Region 10] as an IEEE PES High Performing Student Branch Chapter in 2020. Continuing the pursuit of excellence, this chapter has been awarded the title of High Performing Student Branch Chapter back-to-back in 2021, 2022, 2023 & 2024, with the highest grant received in Bangladesh. This recognition underscores the commitment to innovation, collaboration, and leadership in the realm of power and energy engineering. "
      ],
      "image": "pes.png"
    },
    {
      "id": "ieee-nsu-ias-sbc",
      "title": "About IAS",
      "color": "#0f904b",
      "description": [
        "Like other technical societies under the Institute of Electrical and Electronics Engineers (IEEE), the IEEE Industry Applications Society (IEEE IAS) is also a society that works to make the transition between academics and corporations easier to pursue a better career.",
        "The IEEE North South University Industry Application Society was formed on June 9, 2018 as a chapter of the IEEE North South University Student Branch. Since day one, the priority of this foundation has been to validate the collaboration between students and corporations. To achieve this target, the society's members are working with their full potential to set a benchmark for the future.",
        "The society has also participated successfully in the very first summit of the IEEE Bangladesh Section Industry Application Society. Besides organizing events, they have also arranged several workshops in which professionals from different organizations instructed."
      ],
      "image": "ias.png"
    },
    {
      "id": "ieee-nsu-wie-ag",
      "title": "About WIE",
      "color": "#006699",
      "description": [
        "IEEE NSU Student Branch, Women in Engineering Affinity Group, is dedicated to empowering and inspiring women at North South University and beyond to pursue careers in IT and engineering. We envision a passionate community of IEEE members, both women and men, utilizing their talents for the betterment of our affinity group.",
        "This affinity group was established in 20th June 2016 and since then its members have been actively working on their events and projects. Historically in Bangladesh (and also in NSU), the female presence has been low in science and engineering subjects. So we have been working hard to encourage, engage and motivate the female students through IEEE opportunities for developing their skills in IT and engineering for professional career development.",
        "Our diverse events, encompassing both technical and non-technical events, aim to empower students through workshops, mentorship programs, and various initiatives, providing them with the skills and necessary support for success in STEM careers."
      ],
      "image": "wie.png"
    }
  ]
}